Revit 2026 API

# ViewScheduleMergeSegments Method

---

Merges two adjacent segments into one.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void MergeSegments(
	int movedSegmentIndex,
	int targetSegmentIndex
)
```
```vb
Public Sub MergeSegments (
	movedSegmentIndex As Integer,
	targetSegmentIndex As Integer
)
```
```cpp
public:
void MergeSegments(
	int movedSegmentIndex,
	int targetSegmentIndex
)
```
```fsharp
member MergeSegments :
        movedSegmentIndex : int *
        targetSegmentIndex : int -> unit
```

#### Parameters

movedSegmentIndex Int32
     The index of the moved segment.
targetSegmentIndex Int32
     The index of the target segment.

| Exception | Condition |
| --- | --- |
| ArgumentException | Only two adjacent segments can be merged. -or- The segment index should start from 0 and be less than the total segment count. |

Only adjacent segments can be merged. The moved segment will be deleted with all its instances on sheet and all the data will be merged into the target segment with height expanded.

#### Reference

ViewSchedule Class

Autodesk.Revit.DB Namespace